app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @names = Student.all.map{|student| student.to_s}